In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('C:/Users/dell/Downloads/titanic.csv')

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
data.index

RangeIndex(start=0, stop=891, step=1)

In [11]:
data.iloc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Name: 2, dtype: object

In [12]:
data.iloc[2]['Name']

'Heikkinen, Miss. Laina'

In [18]:
data.loc[[0,33,45,89]][['Name']]

                        Name
0    Braund, Mr. Owen Harris
33     Wheadon, Mr. Edward H
45  Rogers, Mr. William John
89    Celotti, Mr. Francesco

In [19]:
data['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [25]:
sex = pd.get_dummies(data['Sex'],drop_first=True)
sex

      male
0     True
1    False
2    False
3    False
4     True
..     ...
886   True
887  False
888  False
889   True
890   True

[891 rows x 1 columns]

In [24]:
pclass = pd.get_dummies(data['Pclass'], drop_first = True)
pclass

         2      3
0    False   True
1    False  False
2    False   True
3    False  False
4    False   True
..     ...    ...
886   True  False
887  False  False
888  False   True
889  False  False
890  False   True

[891 rows x 2 columns]

In [26]:
Embarked = pd.get_dummies(data['Embarked'],drop_first=True)
Embarked

         Q      S
0    False   True
1    False  False
2    False   True
3    False   True
4    False   True
..     ...    ...
886  False   True
887  False   True
888  False   True
889  False  False
890   True  False

[891 rows x 2 columns]

In [28]:
'''
Plotly is a python library is used to design graphs, especially intercative graphs.
It can plot different types of graphs and charts like histograms, barplot, boxplot, areaplot and many more.
It is mainly used in the data anaysis as well as financial analysis. It is an interactive vizualization library.

cufflinks connects plotly with pandas to create charts and graphs of dataframes directly.
'''

1

In [29]:
import plotly as py
import cufflinks as cf
from plotly.offline import iplot # Interactive plot
py.offline.init_notebook_mode(connected = True)
cf.go_offline()
import plotly.io as pio

In [30]:
# To get list of renderers
# pio.renderers

In [31]:
a = pd.DataFrame({'category':['A','B','C'],
                  'marks':[65,55,78]})

In [ ]:
import plotly.graph_objects as go

a.iplot(kind = 'bar', x = 'category', y